Modul eFORM/Integračný manuál eFORM/Externá zbernica (USR)/ChangeSubscriberEndpointUrl/EFORM_CHANGESUBSCRIBERENDPOINTURL_SOAP_V_1_0__REQ.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<s:Header>
		<Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://schemas.gov.sk/ServiceBus/service/1.0/IServiceBus/CallService</Action>
		<ActivityId CorrelationId="a5bae371-f07e-4de6-9600-f2b66f3a4a1c" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">db794f7c-51e0-475e-a299-e0c7c7b3559e</ActivityId>
		<VsDebuggerCausalityData xmlns="http://schemas.microsoft.com/vstudio/diagnostics/servicemodelsink"/>
	</s:Header>
	<s:Body>
		<CallService xmlns="http://schemas.gov.sk/ServiceBus/service/1.0">
			<serviceClass>EFORM_CHANGESUBSCRIBERENDPOINTURL_SOAP_V_1_0</serviceClass>
			<serviceParameter xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:d4p2="http://schemas.gov.sk/ServiceBusServiceProvider/Ness/eFormProvider/1.0" i:type="d4p2:ChangeSubscriberEndpointUrlReq">
				<d4p2:EndpointUrl>http://changeURL.org</d4p2:EndpointUrl>
				<d4p2:SubscribedGestor>Testcase.TS</d4p2:SubscribedGestor>
				<d4p2:SubscribedPublisher>UPVS</d4p2:SubscribedPublisher>
			</serviceParameter>
		</CallService>
	</s:Body>
</s:Envelope>
